jincai-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-24 四 15:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jincai" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d94e6a">1. Jincai' Emacs configurations</a>
<ul>
<li><a href="#org280045a">1.1. 插件管理(Must Top)</a></li>
<li><a href="#orgfbc6dac">1.2. 启动初始化</a></li>
<li><a href="#org3358915">1.3. 视觉层配置</a></li>
<li><a href="#orgea58849">1.4. 快捷键配置</a></li>
<li><a href="#org8707905">1.5. 常用变量</a></li>
<li><a href="#org4882285">1.6. 自动补全</a></li>
<li><a href="#orgd1c8e5a">1.7. 文件操作</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8d94e6a" class="outline-2">
<h2 id="org8d94e6a"><span class="section-number-2">1</span> Jincai' Emacs configurations</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org280045a" class="outline-3">
<h3 id="org280045a"><span class="section-number-3">1.1</span> 插件管理(Must Top)</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">Added by Package.el.  This must come before configurations of</span>
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">installed packages.  Don't delete this line.  If you don't want it,</span>
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">just comment it out by adding a semicolon to the start of the line.</span>
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">You may delete these explanatory comments.</span>
(<span style="color: #FF1493;">require</span> '<span style="color: #AF87FF;">package</span>)
(add-to-list 'package-archives '(<span style="color: #CDC673;">"melpa"</span> . <span style="color: #CDC673;">"https://melpa.org/packages/"</span>) t)
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`</span>
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">and `package-pinned-packages`. Most users will not need or want to do this.</span>
(add-to-list 'package-archives '(<span style="color: #CDC673;">"melpa-stable"</span> . <span style="color: #CDC673;">"http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/"</span>) t)
(<span style="color: #FF1493;">setq</span> package-check-signature nil)
(package-initialize)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbc6dac" class="outline-3">
<h3 id="orgfbc6dac"><span class="section-number-3">1.2</span> 启动初始化</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #FF1493;">if</span> (string-match <span style="color: #CDC673;">"XEmacs</span><span style="color: #AF87FF;">\\</span><span style="color: #CDC673;">|</span><span style="color: #CDC673;">Lucid"</span> emacs-version)
<span style="color: #8B8878;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
  <span style="color: #8B8878;">;;; </span><span style="color: #8B8878;">XEmacs</span>
  <span style="color: #8B8878;">;;; </span><span style="color: #8B8878;">------</span>
  <span style="color: #8B8878;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
  (<span style="color: #FF1493;">progn</span>
     (<span style="color: #FF1493;">if</span> (file-readable-p <span style="color: #CDC673;">"~/.xemacs/init.el"</span>)
        (load <span style="color: #CDC673;">"~/.xemacs/init.el"</span> nil t))
  )
  <span style="color: #8B8878;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
  <span style="color: #8B8878;">;;; </span><span style="color: #8B8878;">GNU-Emacs</span>
  <span style="color: #8B8878;">;;; </span><span style="color: #8B8878;">---------</span>
  <span style="color: #8B8878;">;;; </span><span style="color: #8B8878;">load ~/.gnu-emacs or, if not exists /etc/skel/.gnu-emacs</span>
  <span style="color: #8B8878;">;;; </span><span style="color: #8B8878;">For a description and the settings see /etc/skel/.gnu-emacs</span>
  <span style="color: #8B8878;">;;;   </span><span style="color: #8B8878;">... for your private ~/.gnu-emacs your are on your one.</span>
  <span style="color: #8B8878;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
  (<span style="color: #FF1493;">if</span> (file-readable-p <span style="color: #CDC673;">"~/.gnu-emacs"</span>)
      (load <span style="color: #CDC673;">"~/.gnu-emacs"</span> nil t)
    (<span style="color: #FF1493;">if</span> (file-readable-p <span style="color: #CDC673;">"/etc/skel/.gnu-emacs"</span>)
        (load <span style="color: #CDC673;">"/etc/skel/.gnu-emacs"</span> nil t)))

  <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">Custom Settings</span>
  <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">===============</span>
  <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">To avoid any trouble with the customization system of GNU emacs</span>
  <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">we set the default file ~/.gnu-emacs-custom</span>
  (<span style="color: #FF1493;">setq</span> custom-file <span style="color: #CDC673;">"~/.gnu-emacs-custom"</span>)
  (load <span style="color: #CDC673;">"~/.gnu-emacs-custom"</span> t t)

)
<span style="color: #8B8878;">;;;</span><span style="color: #8B8878;">&#20851;&#38381;&#27426;&#36814;</span>
(<span style="color: #FF1493;">setq</span> inhibit-splash-screen 1)

</pre>
</div>
</div>
</div>

<div id="outline-container-org3358915" class="outline-3">
<h3 id="org3358915"><span class="section-number-3">1.3</span> 视觉层配置</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(put 'set-goal-column 'disabled nil)
(put 'scroll-left 'disabled nil)
(put 'narrow-to-region 'disabled nil)
(put 'narrow-to-page 'disabled nil)
(<span style="color: #FF1493;">setq</span> cursor-type 'bar)
<span style="color: #8B8878;">;;;</span><span style="color: #8B8878;">(global-linum-mode 1)</span>
<span style="color: #8B8878;">;;;</span><span style="color: #8B8878;">(setq inhibit-splash-screen 1)</span>
(set-face-attribute 'default nil <span style="color: #FF1493;">:height</span> 120)
<span style="color: #8B8878;">;;;</span><span style="color: #8B8878;">&#20027;&#39064;</span>
(load-theme 'monokai t)
(<span style="color: #FF1493;">setq</span> <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">foreground and background</span>
      monokai-foreground     <span style="color: #CDC673;">"#ABB2BF"</span>
      monokai-background     <span style="color: #CDC673;">"#282C34"</span>
      <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">highlights and comments</span>
      monokai-comments       <span style="color: #CDC673;">"#F8F8F0"</span>
      monokai-emphasis       <span style="color: #CDC673;">"#282C34"</span>
      monokai-highlight      <span style="color: #CDC673;">"#FFB269"</span>
      monokai-highlight-alt  <span style="color: #CDC673;">"#66D9EF"</span>
      monokai-highlight-line <span style="color: #CDC673;">"#1B1D1E"</span>
      monokai-line-number    <span style="color: #CDC673;">"#F8F8F0"</span>
      <span style="color: #8B8878;">;; </span><span style="color: #8B8878;">colours</span>
      monokai-blue           <span style="color: #CDC673;">"#61AFEF"</span>
      monokai-cyan           <span style="color: #CDC673;">"#56B6C2"</span>
      monokai-green          <span style="color: #CDC673;">"#98C379"</span>
      monokai-gray           <span style="color: #CDC673;">"#3E4451"</span>
      monokai-violet         <span style="color: #CDC673;">"#C678DD"</span>
      monokai-red            <span style="color: #CDC673;">"#E06C75"</span>
      monokai-orange         <span style="color: #CDC673;">"#D19A66"</span>
      monokai-yellow         <span style="color: #CDC673;">"#E5C07B"</span>)

</pre>
</div>
</div>
</div>
