jincai-emacs.org
** 快捷键配置

#+BEGIN_SRC emacs-lisp
(defun open-init-file()
  (interactive)
  (find-file "~/.emacs.d/init.el"))
(global-set-key (kbd "<f2>") 'open-init-file)
;;;最近打开文件
(require 'recentf)
(recentf-mode 1)
(setq recentf-max-menu-item 10)
(global-set-key (kbd "C-x C-r") 'recentf-open-files)
(global-set-key "\C-cs" 'swiper)

;;选中区域
(require 'expand-region)
(global-set-key (kbd "C-=") 'er/expand-region)

;;多区域编辑                                                                                                                                                            
(global-set-key (kbd "C-c o") 'iedit-mode)                                                                                                                              
                                                                                                                                                                        
;;C-n C-p替换M-n M-p                                                                                                                                                    
(with-eval-after-load 'company                                                                                                                                          
  (define-key company-active-map (kbd "M-n") nil)                                                                                                                       
  (define-key company-active-map (kbd "M-p") nil)                                                                                                                       
  (define-key company-active-map (kbd "C-n") #'company-select-next)                                                                                                     
  (define-key company-active-map (kbd "C-p") #'company-select-previous))

;;for python配置
;; Fixing a key binding bug in elpy
;;(yas-reload-all)
;;(add-hook 'prog-mode-hook #'yas-minor-mode)
;;(define-key yas-minor-mode-map (kbd "C-c k") 'yas-expand)

;; 设置 org-agenda 打开快捷键
;;(global-set-key (kbd "C-c a") 'org-agenda)
(global-set-key "\C-cl" 'org-store-link)
(global-set-key "\C-ca" 'org-agenda)
(global-set-key "\C-cb" 'org-iswitchb)
(global-set-key "\C-cc" 'org-capture)

#+END_SRC

#+RESULTS:
: org-capture

** 常用变量

#+BEGIN_SRC emacs-lisp

(delete-selection-mode 1)
(global-hungry-delete-mode t)
(fset 'yes-or-no-p 'y-or-n-p)

#+END_SRC

** 自动补全,缩进

#+BEGIN_SRC emacs-lisp

(global-company-mode 1)
(ivy-mode t)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
(add-hook 'prog-mode-hook 'smartparens-mode)
(add-hook 'org-mode-hook 'smartparens-mode)
;;括号高亮
(define-advice show-paren-function (:around (fn) fix-show-paren-function)
  "Highlight enclosing parens."
  (cond ((looking-at-p "\\s(") (funcall fn))
	(t (save-excursion
	     (ignore-errors (backward-up-list))
	     (funcall fn)))))
(add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
(add-hook 'prog-mode-hook 'show-paren-mode)
(add-hook 'org-mode-hook 'show-paren-mode)

(setq hippie-expand-try-function-list '(try-expand-debbrev
					try-expand-debbrev-all-buffers
					try-expand-debbrev-from-kill
					try-complete-file-name-partially
					try-complete-file-name
					try-expand-all-abbrevs
					try-expand-list
					try-expand-line
					try-complete-lisp-symbol-partially
					try-complete-lisp-symbol))

(defun my-web-mode-indent-setup ()
  (setq web-mode-markup-indent-offset 2) ; web-mode, html tag in html file
  (setq web-mode-css-indent-offset 2)    ; web-mode, css in html file
  (setq web-mode-code-indent-offset 2)   ; web-mode, js code in html file
  )
(add-hook 'web-mode-hook 'my-web-mode-indent-setup)
;;python
(setq tab-width 4)
(set-variable 'python-indent-offset 4)
(setq  python-indent-guess-indent-offset-verbose nil)

#+END_SRC

** 文件操作

#+BEGIN_SRC emacs-lisp

(put 'dired-find-alternate-file 'disabled nil)
;; 主动加载 Dired Mode
;; (require 'dired)
;; (defined-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)

;; 延迟加载
(with-eval-after-load 'dired
    (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file))
(require 'dired-x)
;;;
(setq-default make-backup-files nil)

;;
;;(global-auto-revert-mode 1)


#+END_SRC

