jincai-emacs.html

<div id="outline-container-orgea58849" class="outline-3">
<h3 id="orgea58849"><span class="section-number-3">1.4</span> 快捷键配置</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(<span style="color: #FF1493;">defun</span> <span style="color: #87D700;">open-init-file</span>()
  (<span style="color: #FF1493;">interactive</span>)
  (find-file <span style="color: #CDC673;">"~/.emacs.d/init.el"</span>))
(global-set-key (kbd <span style="color: #CDC673;">"&lt;f2&gt;"</span>) 'open-init-file)
<span style="color: #8B8878;">;;;</span><span style="color: #8B8878;">&#26368;&#36817;&#25171;&#24320;&#25991;&#20214;</span>
(<span style="color: #FF1493;">require</span> '<span style="color: #AF87FF;">recentf</span>)
(recentf-mode 1)
(<span style="color: #FF1493;">setq</span> recentf-max-menu-item 10)
(global-set-key (kbd <span style="color: #CDC673;">"C-x C-r"</span>) 'recentf-open-files)
(global-set-key <span style="color: #CDC673;">"\C-s"</span> 'swiper)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8707905" class="outline-3">
<h3 id="org8707905"><span class="section-number-3">1.5</span> 常用变量</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(delete-selection-mode 1)
(global-hungry-delete-mode t)
(fset 'yes-or-no-p 'y-or-n-p)

</pre>
</div>
</div>
</div>

<div id="outline-container-org4882285" class="outline-3">
<h3 id="org4882285"><span class="section-number-3">1.6</span> 自动补全</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(global-company-mode 1)
(ivy-mode t)
(<span style="color: #FF1493;">setq</span> ivy-use-virtual-buffers t)
(<span style="color: #FF1493;">setq</span> enable-recursive-minibuffers t)
(add-hook 'emacs-lisp-mode-hook 'smartparens-mode)
<span style="color: #8B8878;">;;</span><span style="color: #8B8878;">&#25324;&#21495;&#39640;&#20142;</span>
(<span style="color: #FF1493;">define-advice</span> <span style="color: #87D700;">show-paren-function</span> (<span style="color: #FF1493;">:around</span> (fn) fix-show-paren-function)
  <span style="color: #CDC673;">"Highlight enclosing parens."</span>
  (<span style="color: #FF1493;">cond</span> ((looking-at-p <span style="color: #CDC673;">"\\s("</span>) (funcall fn))
        (t (<span style="color: #FF1493;">save-excursion</span>
             (<span style="color: #FF1493;">ignore-errors</span> (backward-up-list))
             (funcall fn)))))

(<span style="color: #FF1493;">setq</span> hippie-expand-try-function-list '(try-expand-debbrev
                                        try-expand-debbrev-all-buffers
                                        try-expand-debbrev-from-kill
                                        try-complete-file-name-partially
                                        try-complete-file-name
                                        try-expand-all-abbrevs
                                        try-expand-list
                                        try-expand-line
                                        try-complete-lisp-symbol-partially
                                        try-complete-lisp-symbol))


</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1c8e5a" class="outline-3">
<h3 id="orgd1c8e5a"><span class="section-number-3">1.7</span> 文件操作</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp">
(put 'dired-find-alternate-file 'disabled nil)
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">&#20027;&#21160;&#21152;&#36733; Dired Mode</span>
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">(require 'dired)</span>
<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">(defined-key dired-mode-map (kbd "RET") 'dired-find-alternate-file)</span>

<span style="color: #8B8878;">;; </span><span style="color: #8B8878;">&#24310;&#36831;&#21152;&#36733;</span>
(<span style="color: #FF1493;">with-eval-after-load</span> 'dired
    (define-key dired-mode-map (kbd <span style="color: #CDC673;">"RET"</span>) 'dired-find-alternate-file))
(<span style="color: #FF1493;">require</span> '<span style="color: #AF87FF;">dired-x</span>)
<span style="color: #8B8878;">;;;</span>
(<span style="color: #FF1493;">setq-default</span> make-backup-files nil)

<span style="color: #8B8878;">;;</span>
<span style="color: #8B8878;">;;</span><span style="color: #8B8878;">(global-auto-revert-mode 1)</span>


</pre>
</div>

<p>
(defun my-web-mode-indent-setup ()
  (setq web-mode-markup-indent-offset 2) ; web-mode, html tag in html file
  (setq web-mode-css-indent-offset 2)    ; web-mode, css in html file
  (setq web-mode-code-indent-offset 2)   ; web-mode, js code in html file
  )
(add-hook 'web-mode-hook 'my-web-mode-indent-setup)
</p>

<p>
#+END<sub>SRC</sub>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jincai</p>
<p class="date">Created: 2020-12-24 四 15:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
